# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [2]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [3]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [4]:
#  1. Get the total rides for each city type
rides_by_citytyp = pyber_data_df.groupby(['type']).count()['ride_id']

In [5]:
# 2. Get the total drivers for each city type
drivers_by_citytyp = city_data_df.groupby(['type']).sum()['driver_count']

In [6]:
#  3. Get the total amount of fares for each city type
fares_by_citytyp = pyber_data_df.groupby(['type']).sum()['fare']

In [7]:
#  4. Get the average fare per ride for each city type. 
avg_fare_per_ride = fares_by_citytyp/rides_by_citytyp

In [8]:
# 5. Get the average fare per driver for each city type. 
avg_fare_per_driver = fares_by_citytyp/drivers_by_citytyp

In [9]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df = pd.DataFrame({"Total Rides": rides_by_citytyp,
                                "Total drivers": drivers_by_citytyp,
                                "Total Fares": fares_by_citytyp,
                                "Average Fare per Ride": avg_fare_per_ride,
                                "Average Fare per Driver": avg_fare_per_driver,
                                })
pyber_summary_df

,Total Rides,Total drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [10]:
#  8. Format the columns.
# Format the columns.
pyber_summary_df["Total Rides"] = pyber_summary_df["Total Rides"].map("${:,}".format)
pyber_summary_df["Total drivers"] = pyber_summary_df["Total drivers"].map("${:,}".format)
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Ride"] = pyber_summary_df["Average Fare per Ride"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Driver"] = pyber_summary_df["Average Fare per Driver"].map("${:,.2f}".format)

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [11]:
# 1. Read the merged DataFrame
pyber_summary_df

,Total Rides,Total drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,$125,$78,"$4,327.93",$34.62,$55.49
Suburban,$625,$490,"$19,356.33",$30.97,$39.50
Urban,"$1,625","$2,405","$39,854.38",$24.53,$16.57

In [12]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
fares_by_date_df = pd.DataFrame(pyber_data_df.groupby(['date', 'type']).sum()['fare'])

In [13]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index() (use inplace=True to make it sticky)
fares_by_date_df.reset_index(inplace=True)

In [14]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
fares_by_date_df.pivot(index='date', columns='type', values='fare')

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-05-08 04:20:00    NaN       NaN  21.99
2019-05-08 04:39:49    NaN       NaN  18.45
2019-05-08 07:29:01    NaN       NaN  18.55
2019-05-08 11:38:35    NaN       NaN  19.77
2019-05-08 13:10:18    NaN       NaN  18.04

[2375 rows x 3 columns]

In [15]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.
start_date_idx = fares_by_date_df['date']>='2019-01-01'
end_date_idx = fares_by_date_df['date']<'2019-04-30'
date_range_idx = start_date_idx & end_date_idx
fares_by_date_df.loc[date_range_idx]

                     date      type   fare
0     2019-01-01 00:08:16     Urban  37.91
1     2019-01-01 00:46:46  Suburban  47.74
2     2019-01-01 02:07:24  Suburban  24.07
3     2019-01-01 03:46:50     Urban   7.57
4     2019-01-01 05:23:21     Urban  10.75
...                   ...       ...    ...
2213  2019-04-29 20:54:19     Urban  28.41
2214  2019-04-29 21:20:41     Urban  13.59
2215  2019-04-29 22:08:22  Suburban  25.75
2216  2019-04-29 23:05:04     Urban  14.59
2217  2019-04-29 23:10:18  Suburban  29.39

[2218 rows x 3 columns]

In [16]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)
fares_by_date_df['date'].index=pd.to_datetime(fares_by_date_df['date'])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2375 entries, 0 to 2374
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    2375 non-null   object
 1   type    2375 non-null   object
 2   fare    2375 non-null   float64
dtypes: float64(1), object(2)
memory usage: 55.8+ KB

In [17]:
# 7. Check that the datatype for the index is datetime using df.info()
fares_by_date_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2375 entries, 0 to 2374
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    2375 non-null   object
 1   type    2375 non-null   object
 2   fare    2375 non-null   float64
dtypes: float64(1), object(2)
memory usage: 55.8+ KB

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.
fares_by_week_df = fares_by_date_df['date'].resample('W')

In [18]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')